Tekla.Structures.Plugins.DirectManipulation.Internal.HandleManager
This class offers factory methods to create handles.

Tekla.Structures.Plugins.DirectManipulation.Internal.HandleManager.nativeService
The native DM service being wrapped by the handle manager.

Tekla.Structures.Plugins.DirectManipulation.Internal.HandleManager.#ctor(Tekla.BIM.DirectManipulation.Services.Interaction.IHandleInteractorService)
Constructs an instance of the Tekla.Structures.Plugins.DirectManipulation.Internal.HandleManager class.
nativeService: The native DM control to wrap.

Tekla.Structures.Plugins.DirectManipulation.Internal.HandleManager.CreatePointHandle(Tekla.Structures.Geometry3d.Point,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType)


Tekla.Structures.Plugins.DirectManipulation.Internal.HandleManager.CreateLineHandle(Tekla.Structures.Geometry3d.LineSegment,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType)


Tekla.Structures.Plugins.DirectManipulation.Internal.HandleManager.CreatePolycurveHandle(Tekla.Structures.Geometry3d.Polycurve,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType)


Tekla.Structures.Plugins.DirectManipulation.Internal.HandleManager.CreatePolygonalSurfaceHandle(System.Collections.Generic.IEnumerable{Tekla.Structures.Geometry3d.Point},Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType)


Tekla.Structures.Plugins.DirectManipulation.Internal.HandleManager.CreateArcHandle(Tekla.Structures.Geometry3d.Arc,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType,Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType)


Tekla.Structures.Plugins.DirectManipulation.Internal.HandleManager.ToNativeLocationType(Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleLocationType)
Converts a handle location type to its native DM counterpart.
locationType: Handle location type to convert.
Returns: Native DM location type.

Tekla.Structures.Plugins.DirectManipulation.Internal.HandleManager.ToNativeTargetType(Tekla.Structures.Plugins.DirectManipulation.Services.Handles.HandleEffectType)
Converts a handle effect type to its native DM counterpart.
effectType: Handle effect type to convert.
Returns: Native DM target type.